In [1]:
import pandas as pd
from sklearn import linear_model

In [2]:
df=pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
df=df.rename({'test_score(out of 10)':'ts','interview_score(out of 10)':'is','salary($)':'salary'},axis=1)

In [4]:
df

  experience    ts  is  salary
0        NaN   8.0   9   50000
1        NaN   8.0   6   45000
2       five   6.0   7   60000
3        two  10.0  10   65000
4      seven   9.0   6   70000
5      three   7.0  10   62000
6        ten   NaN   7   72000
7     eleven   7.0   8   80000

In [5]:
df.ts.median()

8.0

In [6]:
df.ts.fillna(df.ts.median())

0     8.0
1     8.0
2     6.0
3    10.0
4     9.0
5     7.0
6     8.0
7     7.0
Name: ts, dtype: float64

In [7]:
df.ts=df.ts.fillna(df.ts.median())

In [8]:
df

  experience    ts  is  salary
0        NaN   8.0   9   50000
1        NaN   8.0   6   45000
2       five   6.0   7   60000
3        two  10.0  10   65000
4      seven   9.0   6   70000
5      three   7.0  10   62000
6        ten   8.0   7   72000
7     eleven   7.0   8   80000

In [9]:
!pip install word2number

Requirement already satisfied: word2number in c:\users\rohi\anaconda3\lib\site-packages (1.1)

In [10]:
pip install -r requirements.txt

Note: you may need to restart the kernel to use updated packages.

ERROR: Could not open requirements file: [Errno 2] No such file or directory: 'requirements.txt'

In [11]:
from word2number import w2n

In [12]:
df.experience

0       NaN
1       NaN
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [15]:
df.experience=df.experience.fillna('zero')
df

  experience    ts  is  salary
0       zero   8.0   9   50000
1       zero   8.0   6   45000
2       five   6.0   7   60000
3        two  10.0  10   65000
4      seven   9.0   6   70000
5      three   7.0  10   62000
6        ten   8.0   7   72000
7     eleven   7.0   8   80000

In [17]:
df.experience=df.experience.apply(w2n.word_to_num)

In [18]:
df

   experience    ts  is  salary
0           0   8.0   9   50000
1           0   8.0   6   45000
2           5   6.0   7   60000
3           2  10.0  10   65000
4           7   9.0   6   70000
5           3   7.0  10   62000
6          10   8.0   7   72000
7          11   7.0   8   80000

In [19]:
reg=linear_model.LinearRegression()
reg.fit(df.drop('salary',axis='columns'),df.salary)

LinearRegression()

In [20]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [21]:
reg.intercept_

17737.26346433768

In [22]:
reg.predict([[2,9,6]])#2 yr experience, 9 test score, 6 interview score

array([53205.96797671])

In [23]:
reg.predict([[12,10,10]])#12 yr experience, 10 test score, 10 interview score

array([92002.18340611])